In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ["a", "b", "c"]
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {"a": 10, "b": 20, "c": 30}

# Pandas Series
- unlike numpy, pandas series can be lableled index
- series can hold different types of variables

In [3]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [22]:
# When series got created from Dictionary, 
# index label use the "Key" of dictionary
# value is "Value" of dictionary

pd.Series(d)

a    10
b    20
c    30
dtype: int64

-------

In [12]:
ser1 = pd.Series([1,2,3,4], ["USA", "Germany", "USSR", "Japan"])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,3,4], ["USA", "Germany", "Italy", "Japan"])
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
ser1["USA"]

1

In [19]:
ser1[0]

1

In [20]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

------------

# Pandas Data Frame
- index : row labels
- columns : columns labels

In [77]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(5,4), index = ["A", "B", "C", "D", "E"], columns = ["W", "X", "Y", "Z"])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting Columns

In [78]:
#getting W columns
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [79]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [80]:
type(df["W"])

pandas.core.series.Series

### Selecting Multiple Columns

In [81]:
df[["W", "Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [82]:
df["New"]  = df["W"] + df["Z"]

In [83]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

### Dropping Column

In [84]:
df.drop("New", axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [86]:
df.drop("New", axis = 1, inplace = True)

In [87]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Dropping Rows

In [88]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [89]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
df.shape

(5, 4)

### Selecting Rows

In [91]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [92]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [93]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting Subsets of rows and columns

In [96]:
df.loc["B", "Y"]

-0.8480769834036315

In [94]:
df.loc[["A", "E"]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [95]:
df.loc["A", ["X", "Z"]]

X    0.628133
Z    0.503826
Name: A, dtype: float64

In [97]:
df.loc[["A", "B"], ["W", "Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

-------

### Boolean Indexing

In [98]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [99]:
bool_df = df > 0

In [100]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [101]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
df[df["W"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [105]:
# grab all points where Z is less than 0
df[df["Z"] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [111]:
df[df["W"] > 0]["X"]["A"]

0.6281327087844596

### Breaking the steps down for selecting

In [120]:
bool_ser = df["W"] > 0
results = df[bool_ser]
columns = ["X", "Y"]
results[columns]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [119]:
bool_ser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [115]:
results

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

--------

### Multiple conditions
- use `&` for AND - pandas with clear seperation with Parathesis ()
- normal python `and` can only work on single boolean comparison and will get confused if you try to use it
- use `|` for OR

In [122]:
df[df["W"] > 0 and df["Y"] > 1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [124]:
df[(df["W"] > 0) & (df["Y"] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [125]:
df[(df["W"] > 0) | (df["Y"] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

------

### Resetting Index

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [127]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

-----------

### Setting Index with existing Column

In [129]:
new_index = "CA NY WY OR CO".split()
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [130]:
df["States"] = new_index

In [131]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [132]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

---------

# Multi Level Index Data Frames / Index Hierarchries

In [135]:
# index levels
outside = ["G1", "G1", "G1", "G2", "G2", "G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [137]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [139]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=["A", "B"])

In [140]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [142]:
df.loc["G1"]

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [146]:
df.index.names

FrozenList([None, None])

### Naming Index Hierarchries

In [149]:
#outer level, inner level
df.index.names = ["Groups", "Num"]

In [150]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [158]:
### Grabbing Inner Values

In [154]:
df.loc["G2"]

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [156]:
df.loc["G2"].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [157]:
df.loc["G2"].loc[2]["B"]

0.07295967531703869

In [159]:
# Grabbing Inner Values practice
df.loc["G1"].loc[3]["A"]

-0.13484072060601238

---------

### Cross Section of Rows and Columns
- when using `loc` can be sometimes tricky
- so sometimes, we need to use `xs` if we need to get some cross section data

In [160]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [162]:
#getting G1 
df.loc["G1"]

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [163]:
# getting G1 using cross section
df.xs("G1")

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

### Getting All vaues of Num 1
- df.xs("index label", level = "index label name")

In [166]:
# gettting all values of Num 1
df.xs(1, level = "Num")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

------------------

# Missing Data

In [167]:
d = {"A": [1,2,np.nan], "B": [5,np.nan, np.nan], "C": [1,2,3]}

In [168]:
df = pd.DataFrame(d)

In [169]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Drop NaN values

In [171]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [172]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [174]:
# threshshould : means retain the rows, columns which have at least these number of filled values
# here row 1 is included in the result, because it has at least 2 filled values, only one of them is NaN
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [175]:
df.dropna(axis = 1, thresh  = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

### Fill NaN values

In [176]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
df.fillna("FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [181]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [182]:
# fill na with mean value
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

-------------

# GroupBy

In [183]:
data = {
    "Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
    "Person": ["Sam", "Charlie", "Amy", "Venessa", "Carl", "Sarah"],
    "Sales": [200, 120, 340, 124, 243, 350]
}

In [184]:
df = pd.DataFrame(data)

In [185]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [186]:
byCompany = df.groupby("Company")

In [187]:
#got as GroupBy Object
byCompany

In [188]:
# then we can use this object to make some aggregreation methods
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [189]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [190]:
byCompany.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [192]:
byCompany.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Venessa    340

In [193]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [194]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [195]:
byCompany.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [196]:
df.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [199]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [198]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

## groupby and describe

In [200]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [201]:
df.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [207]:
df.groupby("Company").describe().transpose()["FB"]

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

----------

# Merging, Joining and Concatenating